Repository: bravesoftdz/hgs
Catalog: common/dzlib/translations/*/dzlib.po
Languages: de

source: Error writing string of length %d to stream, wrote only %d bytes: %%1:s (%%0:d)
de: Fehler beim Schreiben einer Zeichenkette der Länge %d in den Stream, nur %d Bytes wurden geschrieben: %%1:s (%%0:d)

source: no matching object found
de: kein passendes Objekt gefunden

source: String value for [%s]%s must not be empty in ini file
de: String-Wert für [%s]%s in INI-Datei darf nicht leer sein

source: Invalid floating point value "%s" for [%s]\%s in ini file
de: Ungültiger Fließkommawert "%s" für [%s]\%s in ini-Datei

source: Invalid date value "%s" for [%s]\%s in ini file
de: Ungültiger Datumswert "%s" für [%s]\%s in ini-Datei

source: Invalid integer value "%s" for [%s]\%s in ini file
de: Ungültiger Ganzzahlwert "%s" für [%s]\%s in ini-Datei

source: Section "%s" does not exist in ini file
de: Section "%s" existiert nicht in ini-Datei

source: Unknown HKEY value $%.8x
de: Unbekannter HKEY-Wert $%.8x

source: Could not open registry key "%s\%s"
de: Konnte Registry-Schlüssel "%s\%s" nicht öffnen

source: Invalid character "%s".
de: Ungültiges Zeichen "%s".

source: Digit out of range %s
de: Ungültige Ziffer %s

source: Digit #%d (%s) out of range
de: Ungültige Ziffer #%d (%s)

source: "%s" is not a valid integer value: %s
de: "%s" ist kein gültiger Integerwert: %s

source: "%s" is not a valid Int64 value: %s
de: "%s" ist kein gültiger Int64 Wert: %s

source: "%s" is not a valid floating point value: %s
de: "%s" ist kein gültiger Fließkommawert: %s

source: Length of byte array (%d) does not match size of a LongWord (%d)
de: Länge des Byte-Arrays (%d) stimmt nicht mit der Größe eines Longwords (%d) überein

source: True
de: Wahr

source: False
de: Falsch

source: Yes
de: Ja

source: No
de: Nein

source: Y(es)
de: J

source: N(o)
de: N

source: DLL entry point not initialized
de: DLL Einsprungpunkt nicht initialisiert

source: Field "%s" not found in table "%s".
de: Feld "%s" nicht in Tabelle "%s" gefunden.

source: Field %s.%s is not large enough to hold value "%s". (Field size: %d, Value length: %d)
de: Feld %s.%s is nicht groß genug, um den Wert "%s" zu speichern (Feldgröße: %d, Wertlänge: %d)

source: SetParamByName is not supported for a %s.
de: SetParamByName wird für %s nicht unterstützt.

source: TrySetParamByName is not supported for a %s.
de: SetParamByName wird für %s nicht unterstützt.

source: SetParamByName is not supported for a %s (only TADODataSet descendants).
de: SetParamByName wird für %s nicht unterstützt (nur TADODataSet-Abkömmlinge).

source: TrySetParamByName is not supported for a %s (only TADODataSet descendants).
de: TrySetParamByName wird für %s nicht unterstützt (nur TADODataSet-Abkömmlinge).

source: SetParamByName is not supported for a %s (only TADQuery descendants).
de: SetParamByName wird für %s nicht unterstützt (nur TADQuery-Abkömmlinge)

source: TrySetParamByName is not supported for a %s (only TADQuery descendants).
de: TrySetParamByName wird für %s nicht unterstützt (nur TADQuery-Abkömmlinge).

source: SetParamByName is not supported for a %s (only TQuery descendants).
de: SetParamByName wird für %s nicht unterstützt (nur TQuery-Abkömmlinge)

source: TrySetParamByName is not supported for a %s (only TQuery descendants).
de: TrySetParamByName wird für %s nicht unterstützt (nur TQuery-Abkömmlinge).

source: SetParamByName is not supported for a %s (only TMSQuery descendants).
de: SetParamByName wird für %s nicht unterstützt (nur TMSQuery-Abkömmlinge)

source: TrySetParamByName is not supported for a %s (only TMSQuery descendants).
de: TrySetParamByName wird für %s nicht unterstützt (nur TMSQuery-Abkömmlinge).

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

source: Invalid value for DayOfWeek: %d
de: Ungültiger Wert für DayOfWeek: %d

source: January
de: Januar

source: February
de: Februar

source: March
de: März

source: May
de: Mai

source: June
de: Juni

source: July
de: Juli

source: October
de: Oktober

source: December
de: Dezember

source: Invalid month number %d
de: Ungültige Monatsnummer %d

source: TdzDuration value is invalid.
de: TdzDuration Wert ist ungültig.

source: Could not seek to byte %d
de: Konnte nicht zu Byte %d springen

source: This program does nothing yet.
de: Dieses Programm macht noch nichts.

source: Example %d:
de: Beispiel %d:

source: Error: %s
de: Fehler: %s

source: When called as:
de: Wenn aufgerufen als:

source: Help follows:
de: Hilfe:

source: Synopsis: %s %s
de: Aufruf: %s %s

source: Parameters:
de: Parameter:

source: Options:
de: Optionen:

source: Write a startup log to the given file.
de: Startup-Log in angegebene Datei schreiben.

source: AVI files
de: AVI-Dateien

source: Bitmap Files
de: Bitmap-Dateien

source: DBase tables
de: DBase-Tabellen

source: Executable Files
de: Ausführbare Dateien

source: GIF Image
de: GIF-Bilder

source: INI files
de: INI-Dateien

source: JPEG Files
de: JPEG Dateien

source: Log files
de: Log-Dateien

source: Microsoft Access Databases
de: Microsoft Access Datenbanken

source: Picture files
de: Bilddateien

source: Text files
de: Text-Dateien

source: Microsoft Excel File Format
de: Microsoft Excel Dateiformat

source: all files
de: Alle Dateien

source: Could not load %s.
de: Konnte %s nicht laden.

source: Could not find entry point %s in %s ERROR= %%d, %%s
de: Konnte Einsprungpunkt %s nicht in %s finden Fehler: %%d, %%s

source: Can not free Executor while a process using redirection is still running.
de: Kann Executor nicht freigeben während noch ein Prozess mit Ein-/Ausgabeumleitung läuft.

source: Process has not yet been started. %s
de: Prozess wurde noch nicht gestarted. %s

source: Process is still running. %s
de: Prozess läuft noch. %s

source: Process has terminated. %s
de: Prozess ist beendet. %s

source: Process has not yet been started
de: Prozess wurde noch nicht gestartet

source: Process has already been started.
de: Prozess wurde bereits gestartet

source: StdErr was not redirected
de: StdErr wurde nicht umgeleitet

source: StdOut was not redirected
de: StdOut wurde nicht umgeleitet

source: %%1:s (%%0:d) trying to open "%s"
de: %%1:s (%%0:d) beim Öffnen von "%s"

source: Invalid file attributes
de: Ungültige Dateiattribute

source: Invalid file flags
de: Ungültige Dateiflags

source: Error %%1:s (%%0:d) writing to file %s. Wrote only %d of %d bytes.
de: Fehler %%1:s (%%0:d) beim Schreiben in Datei %s. Es wurden nur %d von %d Bytes geschrieben.

source: "%s" File
de: "%s" Datei

source: TFileSystem.GetTempPath: %1:s (code: %0:d) calling Windows.GetTempPath
de: TFileSystem.GetTempPath: %1:s (code: %0:d) beim Aufruf von Windows.GetTempPath

source: <no volume name>
de: <kein Volume-Name>

source: Error %%1:s (%%0:d) creating directory "%s"
de: Fehler %%1:s (%%0:d) beim Erstellen des Verzeichnisses "%s"

source: Could not find a unique directory name based on "%s"
de: Konnte keinen eindeutigen Verzeichnisnamen basierend auf "%s" finden.

source: TFileSystem.GetTempFilename: %1:s (Code: %0:d) calling Windows.GetTempFileName
de: TFileSystem.GetTempFilename: %1:s (Code: %0:d) beim Aufruf von Windows.GetTempFileName

source: File not found: "%s"
de: Datei nicht gefunden: "%s"

source: TFileSystem.GetShortPathname: %1:s (Code: %0:d) calling Windows.GetShortPathname
de: TFileSystem.GetShortPathname: %1:s (Code: %0:d) beim Aufruf von Windows.GetShortPathname

source: Short pathname is longer than MAX_PATH (%d) characters
de: Kurzer Pfad ist länger als MAX_PATH (%d) Zeichen

source: Error %%1:s (%%0:d) while trying to move "%s" to "%s".
de: Fehler %%1:s (%%0:d) beim Verschieben von "%s" nach "%s".

source: Error %%1:s (%%0:d) while changing the readonly flag of "%s"
de: Fehler %%1:s (%%0:d) beim Ändern des Schreibschutz-Flags von "%s"

source: Error %%1:s (%%0:d) while trying to copy "%s" to "%s".
de: Fehler %%1:s (%%0:d) beim Kopieren von "%s" nach "%s".

source: Failed to create a backup of "%s". Tried 1000 different file names based on "%s".
de: Fehler beim Erzeugen eines Backups von "%s". Es wurden 1000 verschiedene Dateinamen basierend auf "%s" ausprobiert.

source: Error copying directory "%s" to "%s": Destination path "%s" does not exist.
de: Fehler beim Kopieren des Verzeichnisses "%s" nach "%s": Zielpfad "%s" existiert nicht.

source: Directory %s already exists.
de: Verzeichnis %s existiert bereits.

source: Error %s (%s) in progress callback while trying to copy "%s" to "%s".
de: Fehler %s (%s) im Fortschritts-Callback beim Kopieren von "%s" nach "%s".

source: Error %%1:s (%%0:d) deleting file "%s"
de: Fehler %%1:s (%%0:d) beim Löschen der Datei "%s"

source: File not found: %s
de: Datei nicht gefunden: %s

source: Directory not found: %s
de: Verzeichnis nicht gefunden: "%s"

source: Error creating directory "%s": %s (%s)
de: Fehler beim Erstellen des Verzeichnisses "%s": %s (%s)

source: Error %%1:s (%%0:d) deleting directory "%s"
de: Fehler %%1:s (%%0:d) beim Löschen des Verzeichnisses "%s"

source: "%s" does not exist or is not a directory
de: "%s" existiert nicht oder ist kein Verzeichnis

source: Combination of ResultContainsNumber and KeepOriginal is not allowed
de: Kombination von ResultContainsNumber und KeepOriginal ist nicht erlaubt

source: Could not open file "%s" for writing.
de: Konnte Datei "%s" nicht zum Schreiben öffnen.

source: Could not find file "%s" in search path "%s".
de: Konnte Datei "%s" nicht im Suchpfad finden "%s".

source: Unknown option %s
de: Unbekannte Option %s

source: [options]
de: [Optionen]

source: %s is not a registered option.
de: %s ist keine registrierte Option

source: There are too many parameters.
de: Zuviele Parameter angegeben.

source: There are not enough %s parameters (min: %d)
de: Nicht genügend %s Parameter (min: %d)

source: Option %s is unknown
de: Option %s ist nicht bekannt

source: Option %s requires a value.
de: Option %s benötigt einen Wert.

source: Option %s does not accept a value.
de: Option %s akzeptiert keinen Wert.

source: display parameter help
de: Parameter Hilfe anzeigen

source: Parsing error on JSON answer: Root object size is %d not 3.
de: Parsing-Fehler der JSON Antwort: Größe des Root Objekts ist %d nicht 3.

source: Parsing error on JSON answer: First pair name is "%s" not "responseData".
de: Parsing-Fehler der JSON Antwort: Das erste Paar ist "%s" nicht "responseData".

source: Parsing error on JSON answer: responseData object size is %d not 1.
de: Parsing-Fehler der JSON Antwort: Größé des responseData Objekts ist %d nicht 1.

source: Parsing error on JSON answer: First responseData pair is "%s" not "translatedText".
de: Parsing-Fehler der JSON Antwort: Erstes responseData Paar ist "%s" nicht "translatedText".

source: Parsing error on JSON answer: translatedText data is not a string.
de: Parsing-Fehler der JSON Antwort: translatedText ist keine Zeichenkette.

source: Parsing error on JSON answer: responseData is neither NULL nor an object.
de: Parsing-Fehler der JSON Antwort: responseData ist weder NULL noch ein Objekt.

source: Parsing error on JSON answer: Second pair name is "%s" not "responseDetails".
de: Parsing-Fehler der JSON Antwort: Name des zweiten Paares ist "%s" nicht "responseDetails".

source: Parsing error on JSON answer: responseDetails is neither NULL nor a string.
de: Parsing-Fehler der JSON Antwort: responseDetails ist weder NULL noch eine Zeichenkette.

source: Parsing error on JSON answer: Thrid pair name is "%s" not "responseStatus".
de: Parsing-Fehler der JSON Antwort: Name des dritten Paares ist "%s" nicht "responseStatus".

source: Parsing error on JSON answer: responseStatus is not a number.
de: Parsing-Fehler der JSON Antwort: responsestatus ist keine Zahl.

source: CreateRectRgn failed
de: CreateRectRgn fehlgeschlagen

source: GetClipRgn failed
de: GetClipRgn fehlgeschlagen

source: SelectClipRgn failed
de: SelectClipRgn fehlgeschlagen

source: "%s" is no valid GUID
de: "%s" ist keine gültige GUID

source: 1 week
de: 1 Woche

source: %d weeks
de: %d Wochen

source: 1 day
de: 1 Tag

source: %d days
de: %d Tage

source: 1 hour
de: 1 Stunde

source: %d hours
de: %d Stunden

source: %d minutes
de: %d Minuten

source: 1 second
de: 1 Sekunde

source: %d Seconds
de: %d Sekunden

source: NullableDuration is invalid
de: NullableDuration ist ungültig

source: Duration must start with a "P"
de: Eine Dauer (Duration) muss mit einem "P" beginnen

source: "%s" is not a valid duration string.
de: "%s" ist keine Zeichenkette mit gültiger Dauer.

source: "%s" is not a valid time value.
de: "%s" ist kein gültiger Zeit-Wert.

source: "%s" is not a valid date value.
de: "%s" ist kein gültiger Datumswert.

source: Unexpected end of ICalendar within VCalendar in line %d
de: Unerwartetes Ende von ICalendar innerhalb von VCalendar in Zeile %d

source: %s is not a valid ICalendar line.
de: "%s" ist keine gültige ICalendar Zeile.

source: Unexpected end of ICalendar within VEvent in line %d
de: Unerwartetes Ende von ICalendar innerhalb von VEvent in Zeile %d

source: Unexpected end of ICalendar within VAlarm in line %d
de: Unerwartetes Ende von ICalendar innerhalb von VAlarm in Zeile %d

source: "%s" is not a valid floating point value.
de: "%s" ist kein gültiger Fließkommawert.

source: "%s" is not a valid integer value.
de: "%s" ist kein gültiger Integerwert.

source: "%s" is not a valid time of day value.
de: "%s" ist kein gültiger Wert für eine Uhrzeit.

source: Value must be between %.2f and %.2f.
de: Der Wert muss zwischen %.2f und %.2f liegen.

source: Value must be between %.2f and %.2f or empty.
de: Der Wert muss zwischen %.2f und %.2f liegen oder leer sein.

source: Value must be greater or equal %.2f.
de: Der Wert muss größer oder gleich %.2f sein.

source: Value must be greater than %.2f.
de: Der Wert muss größer als %.2f sein.

source: Must be a floating point value.
de: Muss ein Fließkommawert sein.

source: Must be a floating point value or empty.
de: Muss ein Fließkommawert oder leer sein.

source: Value must be a valid integer number.
de: Der Wert muss eine gültige ganze Zahl sein.

source: Value must be between %d and %d.
de: Der Wert muss zwischen %d und %d liegen.

source: Value must be smaller than %d.
de: Der Wert muss kleiner als %d sein.

source: Value must be greater than %d.
de: Der Wert muss größer als %d sein.

source: Value must be greater or equal %d.
de: Der Wert muss größer oder gleich %d sein.

source: Value must not be empty.
de: Der Wert darf nicht leer sein.

source: No entry selected.
de: Es ist kein Eintrag ausgewählt.

source: unknown Registry Root Key %x
de: unbekannter Registry Rook-Key %x

source: unknown RegDataType
de: unbekannter RegDataType

source: unknown OS error
de: Unbekannter Betriebssystemfehler

source: Error "%1:s (%0:d)" while trying to acquire mutex.
de: Fehler %1:s (%0:d) beim Versuch das Mutex zu erwerben.

source: Entry "%s" not found.
de: Eintrag "%s" nicht gefunden.

source: NullableDate value is invalid
de: NullableDate Wert ist ungültig

source: NullableDateTime is invalid
de: NullableDateTime ist ungültig

source: NullableTime value is invalid
de: NullableTime Wert ist ungültig

source: Could not convert "%s" to %s
de: Konnte "%s" nicht in %s konvertieren

source: %d seconds
de: %d Sekunden

source: invalid
de: ungültig

source: NullableTimespan value is invalid
de: NullableTimespan Wert ist ungültig

source: Option name cannot be empty.
de: Optionsname kann nicht leer sein.

source: Option name must start with an alphanumeric character.
de: Optionsname muss mit einem alphanumerischen Zeichen beginnen.

source: Option name contains invalid character "%s" at position %d.
de: Optionsname enthält ein ungültiges Zeichen "%s" an Position %d.

source: value
de: Wert

source: %s (code %d) calling Windows.GetUsername
de: %s (Code %d) beim Aufruf von Windows.GetUsername

source: Error %1:s (%0:d) calling Windows.ExpandEnvironmentStrings
de: Fehler %1:s (%0:d) beim Aufruf von Windows.ExpandEnvironmentStrings

source: No version information available for %s
de: Keine Versionsinformation für %s verfügbar

source: New capacity cannot be less than current length.
de: Neue Kapazität kann nicht kleiner sein als aktuelle Länge.

source: Could not find RESOURCEDLL "%s"
de: Konnte RESOURCEDLL "%s" nicht finden

source: Could not load RESOURCEDLL "%s"
de: Konnte RESOURCEDLL "%s" nicht laden.

source: Could not lock RESOURCEDLL "%s"
de: Konnte RESOURCEDLL "%s" nicht sperren.

source: RESOURCEDLL "%s" is not valid (Check #1)
de: RESOURCEDLL "%s" ist nicht gültig (Prüfung #1)

source: RESOURCEDLL "%s" is not valid (Check #2)
de: RESOURCEDLL "%s" ist nicht gültig (Prüfung #2)

source: RESOURCEDLL "%s" is not valid (Check #3)
de: RESOURCEDLL "%s" ist nicht gültig (Prüfung #3)

source: Index %d out of bounds.
de: Index %d nicht im gültigen Bereich.

source: ContentLength %d is not valid for a PolyLineZ or PolygonZ record.
de: ContentLength %d ist nicht gültig für einen PolyLineZ oder PolygonZ Datensatz.

source: ContentLength %d is not valid for a MultiPointM record.
de: ContentLength %d ist nicht gültig für einen MultiPointM Datensatz.

source: ContentLength %d is not valid for a MultiPointZ record.
de: ContentLength %d ist nicht gültig für einen MultiPointZ Datensatz.

source: Length of .shp file (%d) differs from file size (%d).
de: Die Länge der .shp-Datei (%d) unterscheidet sich von der Dateigröße (%d).

source: %d is not a valid ShapeType value.
de: %d ist kein gültiger ShapeType-Wert.

source: Cannot calc a bounding box for 0 points.
de: Mann kann keine Bounding-Box für 0 Punkte berechnen.

source: Please set the bounding box first!
de: Bitte setzen Sie zuerst eine Bounding-Box!

source: Cannot calculate moving average on zero elements
de: Kann gleitenden Mittelwert nicht für Null Elemente berechnen

source: nthWord: 0th word not available
de: nthWord: 0tes Wort ist nicht verfügbar

source: Cannot center string that is larger than the maximum length.
de: Kann keinen String zentrieren, der länger als die maximale Länge ist.

source: Strings do not have a 0th character.
de: Strings haben kein 0tes Zeichen.

source: Invalid file access value (%d)
de: Ungültiger Dateizugriffswert (%d)

source: %s accessing file %s
de: %s beim Zugriff auf Datei %s

source: NameValue "%s" does not contain a "=".
de: NameValue "%s" enthält kein "=".

source: Duplicate value name "%s".
de: Doppelter Wert-Name "%s".

source: Empty value for "%s".
de: Leerer Wert für "%s".

source: Variant is Null, should be %s: %s
de: Variant ist Null, sollte %s sein: %s

source: Variant is Empty, should be %s: %s
de: Variant ist leer, sollte %s sein: %s

source: Variant can not be converted to %s: %s
de: Variant kann nicht nach %s konvertiert werden: %s

source: Variant can not be converted to %s
de: Variant kann nicht nach %s konvertiert werden

source: Glyph string contained invalid character at position %d.
de: Der Glyph-Text beinhaltet ein ungültiges Zeichen an Position %d.

source: Bitmap string contained invalid character at position %d.
de: Der Bitmap-String beinhaltete ein ungültiges Zeichen an Position %d.

source: "%s" is not a time value (format: hh:mm:ss) (%s).
de: "%s" ist kein Zeit-Wert (Format: hh:mm:ss) (%s).

source: "%s" is not a valid floating point value (%s).
de: "%s" ist kein gültiger Fließkommawert (%s).

source: No item selected in combobox
de: Kein Eintrag der Combobox ausgewählt

source: No item selected in listbox
de: Kein Eintrag der Listbox ausgewählt

source: Ctrl+Return to 'click' right button.
de: Strg+Enter zum 'Klicken' des rechten Buttons.

source: Call to SHAutoComplete failed.
de: Aufruf von SHAutoComplete fehlgeschlagen

source: File "%s" has no version information.
de: Datei "%s" hat keine Versionsinformation.

source: Invalid version part (%d)
de: Ungültiger Versions-Teil (%d)

source: <no version information>
de: <Keine Versionsinformation>

source: Invalid version info
de: Ungültige Versionsinformationen

source: Error %%1:s (%%0:d) calling CreateFile("%s") Windows API
de: Fehler %%1:s (%%0:d) beim Aufruf der CreateFile("%s") Windows API

source: Error %%1:s (%%0:d) calling CreateFileMapping("%s")
de: Fehler %%1:s (%%0:d) beim Aufruf von CreateFileMaping("%s")

source: Error %%1:s (%%0:d) calling GetFileSizeEx("%s") Windows API
de: Fehler %%1:s (%%0:d) beim Aufruf der GetFileSizeEx("%s") Windows API

source: [%s] does not allow duplicates when trying to insert "%s"
de: [%s] erlaubt keine Duplikate beim Versuch "%s" einzufügen.

source: About %s
de: Über %s

source: Program Info
de: Programm-Info

source: Contact
de: Kontakt

source: Query goes here
de: Die Frage kommt hierher

source: Cancel
de: Abbrechen

source: Progress
de: Fortschritt

source: Action
de: Aktion

source: Abort
de: Abbrechen

source: Called as
de: Aufgerufen als

source: Usage
de: Verwendung

source: Parameters
de: Parameter

source: Options
de: Optionen

source: Examples
de: Beispiele

source: Close
de: Schließen

source: &Next >
de: &Weiter >

source: < &Previous
de: < &Zurück

source: There is no version information available.
de: Es sind keine Versionsinformationen verfügbar.

source: (c) %s
de: © %s

source: Product Name
de: Produktname

source: Product Version
de: Produktversion

source: Company Name
de: Firmenname

source: Description
de: Beschreibung

source: Original Filename
de: Original-Dateiname

source: Internal Name
de: Interner Name

source: File Version
de: Dateiversion

source: Invalid modal result %d.
de: Ungültiger modaler Rückgabewert %d.

source: Do not show again.
de: Nicht nochmal anzeigen.

source: An error occurred: %s
de: Es ist ein Fehler aufgetreten: %s

source: Support Info (see Details for more): %s
de: Support-Information (mehr unter Details): %s

source: Additional information:
de: Erweiterte Informationen:

source: Progress (%d%%)
de: Fortschritt (%d%%)

source: Do you really want to abort?
de: Wollen Sie wirklich abbrechen?

source: must not contain a % at the end
de: darf am Ende kein % enthalten

source: "%" must be followed by "d" or "%".
de: Auf "%" muss "d" oder "%" folgen

source: too many parameters
de: Zuviele Parameter

source: Invalid FormCaption, %s
de: Ungültige Formularüberschrift "%s"

source: &Finish
de: &Fertigstellen

source: Already on first page.
de: Bereits auf erster Seite.

source: Invalid TNullAllowed value
de: Ungültiger TNullAllowed Wert

source: %s is not in 'yes'/'no'
de: %s ist nicht in 'yes'/'no'

source: Invalid TSortOrder value
de: Ungültiger TSortOrder Wert

source: %s is not a valid TSortOrder name
de: "%s" ist kein gültiger TSortOrder Name

source: Invalid TFieldDataType value
de: Ungültiger TFieldDataType-Wert

source: %s is not a valid TFieldDataType name
de: %s ist kein gültiger TFieldDataTyp-Name

source: Invalid boolean value
de: Ungültiger Wahrheitswert

source: Data type of foreign key and primary key of referenced table do not match
de: Datentyp des Fremdschlüssels und des Primärschlüssels der referenzierten Tabelle sind unterschiedlich

source: Could not append index %s. Table %s already has a primary key.
de: Konnte Index %s nicht hinzufügen. Tabelle %s hat schon einen Primärschlüssel.

source: Could not append index %s. Table %s already has a index with that name.
de: Konnte Index %s nicht hinzufügen. Tabelle %s hat schon einen Index mit diesem Namen.

source: Cyclic table references detected
de: Zyklische Tabellenreferenz gefunden

source: Table has no column with name "%s"
de: Tabelle hat keine Spalte mit dem Namen "%s"

source: Can not apply default %s, no variable with that name.
de: Kann Default %s nicht benutzen, es gibt keine Variable mit diesem Namen.

source: There is no script named %s in this db type
de: Es gibt kein Script mit dem Namen %s für diesen DB-Typ
